app/controllers/todos_controller.rb

SELECT "todos".* FROM "todos" WHERE "todos"."isCompleted" = ?  [["isCompleted", 0]]
---
    def index
     @uncompletedTasks = Todo.where(isCompleted: false)

SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def show
        @todo = Todo.find(params[:id])

INSERT INTO "todos" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "test 4"], ["description", "test 4"], ["created_at", "2019-11-30 11:57:52.404036"], ["updated_at", "2019-11-30 11:57:52.404036"]]
---
    def create
        @todo = Todo.create todo_params

SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def edit
        @todo = Todo.find(params[:id])

SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "todos" SET "title" = ?, "description" = ?, "isCompleted" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["title", "Clean my room"], ["description", "It's that time of year again."], ["isCompleted", 1], ["updated_at", "2019-12-01 15:45:06.757190"], ["id", 3]]
---
    def update
        @todo = Todo.find(params[:id])
        @todo.update todo_params

SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
UPDATE "todos" SET "isCompleted" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["isCompleted", 1], ["updated_at", "2019-12-01 13:08:08.271232"], ["id", 20]]
---
    def updatecompleted
        @todo = Todo.find(params[:id])
        @todo.update todo_params

DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 6]]
SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def destroy
        Todo.find(params[:id]).destroy